app/views/formularios/show.html.erb

<% elsif current_user.ocupacao == "dicente" %>
  <% resposta_existente = Resposta.find_by(aluno_id: current_user.id, formulario_id: @formulario.id) %>
---
SELECT "respostas".* FROM "respostas" WHERE "respostas"."aluno_id" = $1 AND "respostas"."formulario_id" = $2 LIMIT $3  [["aluno_id", 44], ["formulario_id", 7], ["LIMIT", 1]]