app/views/turmas/_form.html.erb

        </label>
        <%= f.collection_select :id_docente, User.where(ocupacao: :docente), :id, :nome, prompt: "Selecione", class: "select select-bordered w-full" %>
---
SELECT "users".* FROM "users" WHERE "users"."ocupacao" = $1  [["ocupacao", "docente"]]