app/views/turmas/_participantes.html.erb

                <td>
                  <% turma_aluno = TurmasAluno.find_by(turma_id: turma.id, aluno_id: aluno.id) %>
---
SELECT "turmas_alunos".* FROM "turmas_alunos" WHERE "turmas_alunos"."turma_id" = $1 AND "turmas_alunos"."aluno_id" = $2 LIMIT $3  [["turma_id", 1], ["aluno_id", 2], ["LIMIT", 1]]