app/views/turmas/show.html.erb

    <%= turbo_frame_tag "formularios_frame" do %>
      <% if @turma.formularios.any? %>
---
SELECT 1 AS one FROM "formularios" WHERE "formularios"."turma_id" = $1 LIMIT $2  [["turma_id", 1], ["LIMIT", 1]]