app/controllers/formularios_controller.rb

  def index
    if current_user.ocupacao == "docente"
      turmas_ids = Turma.where(id_docente: current_user.id).pluck(:id)

      @formularios = Formulario
        .includes(:turma, :template)
        .where(id_turma: turmas_ids)
    else
      respondidos_ids = Resposta.where(aluno_id: current_user.id).pluck(:formulario_id)

      @formularios = current_user.controle_de_envios
        .includes(:formulario)
        .map(&:formulario)
        .reject { |f| respondidos_ids.include?(f.id) }
---
SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def exportar_respostas_anonimas
    @formulario = Formulario.find(params[:id])
    perguntas = @formulario.template.formulario["perguntas"]
    respostas = @formulario.respostas.group_by(&:pergunta_index)
---
SELECT "formularios".* FROM "formularios" WHERE "formularios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "templates".* FROM "templates" WHERE "templates"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]