app/controllers/formularios_controller.rb

SELECT "turmas"."id" FROM "turmas" WHERE "turmas"."id_docente" = $1  [["id_docente", 1]]
SELECT "templates".* FROM "templates" WHERE "templates"."id" IN ($1, $2)  [["id", 1], ["id", 3]]
SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" IN ($1, $2)  [["id", 1], ["id", 3]]
SELECT "respostas"."formulario_id" FROM "respostas" WHERE "respostas"."aluno_id" = $1  [["aluno_id", 45]]
SELECT 1 AS one FROM "formularios" WHERE "formularios"."id_turma" IN ($1, $2) LIMIT $3  [["id_turma", 1], ["id_turma", 3], ["LIMIT", 1]]
SELECT "templates".* FROM "templates" WHERE "templates"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "controle_de_envios".* FROM "controle_de_envios" WHERE "controle_de_envios"."aluno_id" = $1  [["aluno_id", 45]]
---
  def index
    if current_user.ocupacao == "docente"
      turmas_ids = Turma.where(id_docente: current_user.id).pluck(:id)

      @formularios = Formulario
        .includes(:turma, :template)
        .where(id_turma: turmas_ids)
    else
      respondidos_ids = Resposta.where(aluno_id: current_user.id).pluck(:formulario_id)

      @formularios = current_user.controle_de_envios
        .includes(:formulario)
        .map(&:formulario)
        .reject { |f| respondidos_ids.include?(f.id) }

SELECT "formularios".* FROM "formularios" WHERE "formularios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "respostas".* FROM "respostas" WHERE "respostas"."formulario_id" = $1 ORDER BY "respostas"."pergunta_index" ASC  [["formulario_id", 1]]
---
  def respostas_anonimas
    @formulario = Formulario.find(params[:id])
    authorize_docente!

    @respostas = @formulario.respostas.order(:pergunta_index)

SELECT "formularios".* FROM "formularios" WHERE "formularios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "templates".* FROM "templates" WHERE "templates"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "respostas".* FROM "respostas" WHERE "respostas"."formulario_id" = $1  [["formulario_id", 1]]
---
  def exportar_respostas_anonimas
    @formulario = Formulario.find(params[:id])
    perguntas = @formulario.template.formulario["perguntas"]
    respostas = @formulario.respostas.group_by(&:pergunta_index)

SELECT "turmas".* FROM "turmas" WHERE "turmas"."id_docente" = $1  [["id_docente", 1]]
SELECT "templates".* FROM "templates"
---
  def new
    @formulario = Formulario.new
    @turmas = Turma.where(id_docente: current_user.id)
    @templates = Template.all

INSERT INTO "formularios" ("id_template", "id_turma", "created_at", "updated_at", "titulo", "descricao", "data_abertura", "data_fechamento", "id_docente") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @formulario = Formulario.new(formulario_params)
    @formulario.docente = current_user

    if @formulario.save

INSERT INTO "controle_de_envios" ("aluno_id", "formulario_id", "is_envio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["aluno_id", 2], ["formulario_id", 3], ["is_envio", true], ["created_at", "2025-07-10 18:30:16.463108"], ["updated_at", "2025-07-10 18:30:16.463108"]]
SELECT "controle_de_envios".* FROM "controle_de_envios" WHERE "controle_de_envios"."aluno_id" = $1 AND "controle_de_envios"."formulario_id" = $2 LIMIT $3  [["aluno_id", 3], ["formulario_id", 1], ["LIMIT", 1]]
---
  def enviar
    turma = @formulario.turma
    alunos = turma.alunos.where(ocupacao: "dicente")

    alunos.each do |aluno|
      ControleDeEnvio.find_or_create_by!(aluno_id: aluno.id, formulario_id: @formulario.id) do |envio|

SELECT "formularios".* FROM "formularios" WHERE "formularios"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_formulario
    @formulario = Formulario.find(params[:id])