app/controllers/respostas_controller.rb

  def create
    formulario = Formulario.find(params[:formulario_id])
---
SELECT "formularios".* FROM "formularios" WHERE "formularios"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]