app/controllers/respostas_controller.rb

SELECT "formularios".* FROM "formularios" WHERE "formularios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "respostas" WHERE "respostas"."formulario_id" = $1 AND "respostas"."aluno_id" = $2 LIMIT $3  [["formulario_id", 1], ["aluno_id", 45], ["LIMIT", 1]]
INSERT INTO "respostas" ("id_formulario", "respostas", "created_at", "updated_at", "aluno_id", "formulario_id", "pergunta_index", "conteudo") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    formulario = Formulario.find(params[:formulario_id])

    if Resposta.exists?(formulario_id: formulario.id, aluno_id: current_user.id)
      redirect_to formulario_path(formulario), alert: "Você já respondeu este formulário."
      return
    end

    respostas_params = params.require(:respostas).permit!.to_h # <- aqui é o segredo!

    respostas_params.each do |_, resposta|
      Resposta.create!(
        formulario_id: formulario.id,
        aluno_id: current_user.id,
        pergunta_index: resposta["pergunta_index"],
        conteudo: resposta["conteudo"]
      )