app/controllers/sigaa_import_controller.rb

  def create
    classes_file = params[:classes_file]
    members_file = params[:members_file]

    if classes_file.blank? || members_file.blank?
      redirect_to sigaa_importar_path, alert: "Você precisa enviar os dois arquivos JSON."
      return
    end

    classes_data = JSON.parse(classes_file.read)
    members_data = JSON.parse(members_file.read)

    ActiveRecord::Base.transaction do
      members_data.each do |entry|
        turma_info = classes_data.find { |t| t["code"] == entry["code"] }

        docente_info = entry["docente"]
        docente = User.find_or_initialize_by(email: docente_info["email"])
        docente.update!(
          nome: docente_info["nome"].titleize,
          curso: docente_info["departamento"],
          matricula: docente_info["usuario"],
          usuario: docente_info["usuario"],
          formacao: docente_info["formacao"],
          ocupacao: "docente",
          password: docente.encrypted_password.present? ? docente.password : "123456"
        )

        turma = Turma.find_or_create_by!(
          code: entry["code"],
          id_docente: docente.id
        ) do |t|
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "[FILTERED]"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "[FILTERED]"], ["LIMIT", 1]]
INSERT INTO "turmas" ("code", "name", "class_data", "id_docente", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

        end

        entry["dicente"].each do |aluno_info|
          aluno = User.find_or_initialize_by(email: aluno_info["email"])
          aluno.update!(
            nome: aluno_info["nome"].titleize,
            curso: aluno_info["curso"],
            matricula: aluno_info["matricula"],
            usuario: aluno_info["usuario"],
            formacao: aluno_info["formacao"],
            ocupacao: "dicente",
            password: aluno.encrypted_password.present? ? aluno.password : "123456"
          )

          TurmasAluno.find_or_create_by!(turma_id: turma.id, aluno_id: aluno.id)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "[FILTERED]"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "[FILTERED]"], ["LIMIT", 1]]
INSERT INTO "turmas_alunos" ("id_turma", "id_aluno", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["id_turma", 2], ["id_aluno", 2], ["created_at", "2025-07-10 00:48:46.709312"], ["updated_at", "2025-07-10 00:48:46.709312"]]
SELECT "turmas_alunos".* FROM "turmas_alunos" WHERE "turmas_alunos"."id_turma" = $1 AND "turmas_alunos"."id_aluno" = $2 LIMIT $3  [["id_turma", 2], ["id_aluno", 2], ["LIMIT", 1]]