app/controllers/templates_controller.rb

SELECT "templates".* FROM "templates" ORDER BY "templates"."created_at" DESC
---
  def index
    @templates = Template.includes(:user).order(created_at: :desc)

SELECT "templates".* FROM "templates" WHERE "templates"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @template = Template.find(params[:id])

INSERT INTO "templates" ("id_user", "formulario", "created_at", "updated_at", "nome") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["id_user", 1], ["formulario", nil], ["created_at", "2025-07-10 17:55:11.813560"], ["updated_at", "2025-07-10 17:55:11.813560"], ["nome", "teste"]]
---
  def create
    params[:template][:formulario] = JSON.parse(params[:template][:formulario]) if params[:template][:formulario].is_a?(String)

    @template = current_user.templates.build(template_params)
    if @template.save

SELECT "templates".* FROM "templates" WHERE "templates"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def edit
    @template = Template.find(params[:id])

UPDATE "templates" SET "formulario" = $1, "updated_at" = $2 WHERE "templates"."id" = $3  [["formulario", "{\"perguntas\":[{\"texto\":\"teste2\",\"tipo\":\"texto\"},{\"texto\":\"teste3\",\"tipo\":\"nota\"}]}"], ["updated_at", "2025-07-10 17:57:33.626145"], ["id", 8]]
---
  def update
    params[:template][:formulario] = JSON.parse(params[:template][:formulario]) if params[:template][:formulario].is_a?(String)

    if @template.update(template_params)

DELETE FROM "templates" WHERE "templates"."id" = $1  [["id", 8]]
---
  def destroy
    @template.destroy

SELECT "templates".* FROM "templates" WHERE "templates"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def set_template
    @template = Template.find(params[:id])