app/controllers/turmas_controller.rb

  def index
    if current_user.ocupacao == "docente"
      @turmas = Turma.includes(:docente).where(id_docente: current_user.id).order(:name)
    else
      @turmas = current_user.turmas_como_aluno.order(:name)
---
SELECT "turmas".* FROM "turmas" WHERE "turmas"."id_docente" = $1 ORDER BY "turmas"."name" ASC  [["id_docente", 1]]
SELECT "turmas".* FROM "turmas" INNER JOIN "turmas_alunos" ON "turmas"."id" = "turmas_alunos"."turma_id" WHERE "turmas_alunos"."aluno_id" = $1 ORDER BY "turmas"."name" ASC  [["aluno_id", 45]]

  def show
    @turma = Turma.includes(:docente, :formularios, :alunos).find(params[:id])

    @pagy_vinculados, @alunos_vinculados = pagy(@turma.alunos.order(:nome), items: 10, page_param: :page_vinculados)

    @formularios_com_respostas = @turma.formularios.includes(:respostas)
---
SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "respostas".* FROM "respostas" WHERE "respostas"."formulario_id" = $1  [["formulario_id", 1]]

  def create
    @turma = Turma.new(turma_params)

    respond_to do |format|
      if @turma.save
---
INSERT INTO "turmas" ("code", "name", "class_data", "id_docente", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    respond_to do |format|
      if @turma.update(turma_params)
---
UPDATE "turmas" SET "class_data" = $1, "updated_at" = $2 WHERE "turmas"."id" = $3  [["class_data", "\"time 35T45 semester 2021.2 classCode TA\""], ["updated_at", "2025-07-10 01:54:50.993833"], ["id", 1]]

  def buscar_alunos
    @turma = Turma.find(params[:id])
    @resultados = User.where("nome ILIKE :q OR matricula ILIKE :q OR email ILIKE :q", q: "%#{params[:query]}%")
                      .where.not(id: @turma.aluno_ids)
---
SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def set_turma
      @turma = Turma.find(params[:id])
---
SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]