app/controllers/turmas_alunos_controller.rb

SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def create
        @turma = Turma.find(params[:turma_id])
        aluno = User.find(params[:aluno_id])

        unless @turma.alunos.include?(aluno)

SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "turmas_alunos".* FROM "turmas_alunos" WHERE "turmas_alunos"."turma_id" = $1 AND "turmas_alunos"."id" = $2 LIMIT $3  [["turma_id", 3], ["id", 46], ["LIMIT", 1]]
DELETE FROM "turmas_alunos" WHERE "turmas_alunos"."id" = $1  [["id", 46]]
---
  def destroy
    @turma_aluno = @turma.turmas_alunos.find(params[:id])
    @aluno = @turma_aluno.aluno
    @turma_aluno.destroy

SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_turma
    @turma = Turma.find(params[:turma_id])